Revit 2026 API

# RebarHostData Properties

---

The RebarHostData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

RebarHostData Class

Autodesk.Revit.DB.Structure Namespace